Repository: jberkovica/uol-fp
Catalog: app/lib/l10n/app_*.arb
Languages: fr, lv, ru

# addDetailsForChild
source: Add details for your child
fr: Ajoutez les détails pour votre enfant
lv: Pievienojiet sava bērna detaļas
ru: Добавьте детали для вашего ребенка

source: Basic Information
fr: Informations de Base
lv: Pamatinformācija
ru: Основная информация

source: Appearance
fr: Apparence
lv: Izskats
ru: Внешность

source: Appearance (Optional)
fr: Apparence (Facultatif)
lv: Izskats (neobligāti)
ru: Внешность (необязательно)

source: Personality & Preferences
fr: Personnalité et Préférences
lv: Personība un preferences
ru: Личность и предпочтения

source: Personality & Preferences (Optional)
fr: Personnalité et Préférences (Facultatif)
lv: Personība un preferences (neobligāti)
ru: Личность и предпочтения (необязательно)

source: Additional Notes
fr: Notes Supplémentaires
lv: Papildu piezīmes
ru: Дополнительные заметки

source: Additional Notes (Optional)
fr: Notes Supplémentaires (Facultatif)
lv: Papildu piezīmes (neobligāti)
ru: Дополнительные заметки (необязательно)

source: Age (Optional)
fr: Âge (Facultatif)
lv: Vecums (neobligāti)
ru: Возраст (необязательно)

source: Choose Avatar
fr: Choisir un Avatar
lv: Izvēlieties avatāru
ru: Выберите аватар

source: Hair Color
fr: Couleur des Cheveux
lv: Matu krāsa
ru: Цвет волос

source: Hair Color (Optional)
fr: Couleur des Cheveux (Facultatif)
lv: Matu krāsa (neobligāti)
ru: Цвет волос (необязательно)

source: Hair Length
fr: Longueur des Cheveux
lv: Matu garums
ru: Длина волос

source: Hair Length (Optional)
fr: Longueur des Cheveux (Facultatif)
lv: Matu garums (neobligāti)
ru: Длина волос (необязательно)

source: Skin Color
fr: Couleur de Peau
lv: Ādas krāsa
ru: Цвет кожи

source: Skin Color (Optional)
fr: Couleur de Peau (Facultatif)
lv: Ādas krāsa (neobligāti)
ru: Цвет кожи (необязательно)

source: Eye Color
fr: Couleur des Yeux
lv: Acu krāsa
ru: Цвет глаз

source: Eye Color (Optional)
fr: Couleur des Yeux (Facultatif)
lv: Acu krāsa (neobligāti)
ru: Цвет глаз (необязательно)

source: Gender
fr: Genre
lv: Dzimums
ru: Пол

source: Gender (Optional)
fr: Genre (Facultatif)
lv: Dzimums (neobligāti)
ru: Пол (необязательно)

source: Favorite Story Types
fr: Types de Contes Favoris
lv: Iecienītie stāstu veidi
ru: Любимые типы историй

source: Favorite Story Types (Optional)
fr: Types de Contes Favoris (Facultatif)
lv: Iecienītie stāstu veidi (neobligāti)
ru: Любимые типы историй (необязательно)

# addSpecialNotes
source: Add any special notes about your child...
fr: Ajoutez des notes spéciales sur votre enfant...
lv: Pievienojiet jebkādas īpašas piezīmes par savu bērnu...
ru: Добавьте любые особые заметки о вашем ребенке...

# addSpecialNotesFor
source: Add any special notes about {childName}...
fr: Ajoutez des notes spéciales sur {childName}...
lv: Pievienojiet jebkādas īpašas piezīmes par {childName}...
ru: Добавьте любые особые заметки о {childName}...

source: Save Changes
fr: Sauvegarder les Modifications
lv: Saglabāt izmaiņas
ru: Сохранить изменения

source: Creating...
fr: Création...
lv: Veido...
ru: Создание...

# failedToUpdateProfile
source: Failed to update profile: {error}
fr: Échec de la mise à jour du profil : {error}
lv: Neizdevās atjaunināt profilu: {error}
ru: Не удалось обновить профиль: {error}

source: Set Your Parent PIN
fr: Définir votre PIN Parental
lv: Iestatīt vecāku PIN
ru: Установите родительский PIN

# createFourDigitPinAccess
source: Create a 4-digit PIN to access parent dashboard and settings
fr: Créez un PIN à 4 chiffres pour accéder au panneau parental et aux paramètres
lv: Izveidojiet 4 ciparu PIN, lai piekļūtu vecāku vadības panelim un iestatījumiem
ru: Создайте 4-значный PIN для доступа к родительской панели и настройкам

source: Setting up your PIN...
fr: Configuration de votre PIN...
lv: Iestata jūsu PIN...
ru: Установка вашего PIN...

# thisWillBeUsedForAccess
source: This PIN will be used to access parent settings and approve stories for your children.
fr: Ce PIN sera utilisé pour accéder aux paramètres parentaux et approuver les contes pour vos enfants.
lv: Šis PIN tiks izmantots, lai piekļūtu vecāku iestatījumiem un apstiprinātu stāstus jūsu bērniem.
ru: Этот PIN будет использоваться для доступа к родительским настройкам и одобрения историй для ваших детей.

# pleaseEnterAllFourDigits
source: Please enter all 4 digits
fr: Veuillez entrer les 4 chiffres
lv: Lūdzu, ievadiet visus 4 ciparus
ru: Пожалуйста, введите все 4 цифры

# failedToSetPin
source: Failed to set PIN. Please try again.
fr: Échec de la définition du PIN. Veuillez réessayer.
lv: Neizdevās iestatīt PIN. Lūdzu, mēģiniet vēlreiz.
ru: Не удалось установить PIN. Пожалуйста, попробуйте еще раз.

source: Tap to start recording
fr: Appuyez pour commencer l'enregistrement
lv: Pieskarieties, lai sāktu ierakstīšanu
ru: Нажмите, чтобы начать запись

source: Pause recording
fr: Pause l'enregistrement
lv: Pauzēt ierakstīšanu
ru: Приостановить запись

source: Start over
fr: Recommencer
lv: Sākt no jauna
ru: Начать заново

source: Play audio
fr: Lire l'audio
lv: Atskaņot audio
ru: Воспроизвести аудио

source: Pause audio
fr: Pause l'audio
lv: Pauzēt audio
ru: Приостановить аудио

source: Submit for transcription
fr: Soumettre pour transcription
lv: Iesniegt transkripciju
ru: Отправить на транскрипцию

source: Dictate Again
fr: Dicter à Nouveau
lv: Diktēt vēlreiz
ru: Диктовать снова

source: Edit as Text
fr: Modifier comme Texte
lv: Rediģēt kā tekstu
ru: Редактировать как текст

source: Select Image Source
fr: Sélectionner la Source d'Image
lv: Izvēlieties attēla avotu
ru: Выберите источник изображения

source: Take Photo
fr: Prendre une Photo
lv: Uzņemt fotoattēlu
ru: Сделать фото

source: Choose from Gallery
fr: Choisir dans la Galerie
lv: Izvēlēties no galerijas
ru: Выбрать из галереи

source: Switch to Text
fr: Passer au Texte
lv: Pārslēgties uz tekstu
ru: Переключиться на текст

source: camera
fr: appareil photo
lv: kamera
ru: камера

source: gallery
fr: galerie
lv: galerija
ru: галерея

source: Age
fr: Âge
lv: Vecums
ru: Возраст

# appearanceOptionalSection
source: Appearance (Optional)
fr: Apparence (Facultatif)
lv: Izskats (neobligāti)
ru: Внешность (необязательно)

# appearanceDescription
source: Describe how your child looks to help create personalized stories.
fr: Décrivez à quoi ressemble votre enfant pour aider à créer des contes personnalisés.
lv: Aprakstiet, kā izskatās jūsu bērns, lai palīdzētu izveidot personalizētus stāstus.
ru: Опишите, как выглядит ваш ребенок, чтобы помочь создать персонализированные истории.

# appearanceMethodQuestion
source: How would you like to describe appearance?
fr: Comment souhaitez-vous décrire l'apparence ?
lv: Kā vēlaties aprakstīt izskatu?
ru: Как вы хотели бы описать внешность?

source: Describe in words
fr: Décrire avec des mots
lv: Aprakstīt ar vārdiem
ru: Описать словами

source: Upload Photo
fr: Télécharger une photo
lv: Augšupielādēt fotoattēlu
ru: Загрузить фото

# aiWillAnalyzePhoto
source: AI will analyze the photo and create a description
fr: L'IA analysera la photo et créera une description
lv: AI analizēs fotoattēlu un izveidos aprakstu
ru: ИИ проанализирует фото и создаст описание

source: Extracting appearance...
fr: Extraction de l'apparence...
lv: Izvelk izskatu...
ru: Извлечение внешности...

# aiExtractedDescription
source: AI extracted this description from your photo. Feel free to review and edit it.
fr: L'IA a extrait cette description de votre photo. N'hésitez pas à la réviser et l'éditer.
lv: AI izveidoja šo aprakstu no jūsu fotoattēla. Lūdzu, pārskatiet un rediģējiet to.
ru: ИИ создал это описание из вашего фото. Пожалуйста, просмотрите и отредактируйте его.

# appearanceExamplePlaceholder
source: Example: "Curly brown hair, bright green eyes, and a gap-toothed smile"
fr: Exemple : "Cheveux bouclés bruns, yeux verts brillants et un sourire avec un écart entre les dents"
lv: Piemērs: "Cirtaini brūni mati, spilgti zaļas acis un smaids ar atstarpi starp zobiem"
ru: Пример: "Кудрявые коричневые волосы, ярко-зеленые глаза и улыбка с щербинкой"

# appearancePhotoPlaceholder
source: Upload a photo above to auto-generate description, or type manually
fr: Téléchargez une photo ci-dessus pour générer automatiquement la description, ou tapez manuellement
lv: Augšupielādējiet fotoattēlu augšpusē, lai automātiski izveidotu aprakstu, vai rakstiet pašrocīgi
ru: Загрузите фото выше для автоматического создания описания, или напишите вручную

# appearanceHelperText
source: Describe hair, eyes, distinctive features, etc. This helps create personalized stories.
fr: Décrivez les cheveux, les yeux, les traits distinctifs, etc. Cela aide à créer des contes personnalisés.
lv: Aprakstiet matus, acis, raksturīgās pazīmes utt. Tas palīdz radīt personalizētus stāstus.
ru: Опишите волосы, глаза, отличительные черты и т.д. Это помогает создавать персонализированные истории.

# aiGeneratedHelperText
source: You can edit this AI-generated description to make it more personal.
fr: Vous pouvez éditer cette description générée par IA pour la rendre plus personnelle.
lv: Jūs varat rediģēt šo AI izveidoto aprakstu, lai padarītu to personīgāku.
ru: Вы можете отредактировать это созданное ИИ описание, чтобы сделать его более личным.

source: Story Preferences (Optional)
fr: Préférences de Contes (Facultatif)
lv: Stāstu preferences (neobligāti)
ru: Предпочтения по историям (необязательно)

source: Preferred Language
fr: Langue Préférée
lv: Vēlamā valoda
ru: Предпочитаемый язык

source: Parent Notes (Optional)
fr: Notes Parentales (Facultatif)
lv: Vecāku piezīmes (neobligāti)
ru: Заметки для родителей (необязательно)

# parentNotesDescription
source: Add special context for stories: hobbies, pets, siblings, interests, etc.
fr: Ajoutez un contexte spécial pour les contes : loisirs, animaux de compagnie, frères et sœurs, intérêts, etc.
lv: Pievienojiet īpašu kontekstu stāstiem: hobiji, mājdzīvnieki, brāļi un māsas, intereses utt.
ru: Добавьте особый контекст для историй: хобби, домашние животные, братья и сестры, интересы и т.д.

# parentNotesExample
source: Example: Loves dinosaurs, has a pet cat named Whiskers...
fr: Exemple : Aime les dinosaures, a un chat nommé Moustaches...
lv: Piemērs: Mīl dinozaurus, ir kaķēns vārdā Ūsiņš...
ru: Пример: Любит динозавров, есть кот по имени Усик...

source: Age (Required)
fr: Âge (Requis)
lv: Vecums (nepieciešams)
ru: Возраст (обязательно)

# appearanceExtractedSuccess
source: Appearance extracted! You can review and edit the description below.
fr: Apparence extraite ! Vous pouvez réviser et éditer la description ci-dessous.
lv: Izskats izvilkts! Jūs varat pārskatīt un rediģēt aprakstu zemāk.
ru: Внешность извлечена! Вы можете просмотреть и отредактировать описание ниже.

# failedToExtractAppearance
source: Failed to extract appearance: {error}
fr: Échec de l'extraction de l'apparence : {error}
lv: Neizdevās izvilkt izskatu: {error}
ru: Не удалось извлечь внешность: {error}

# genreAdventure
source: Adventure
fr: Aventure
lv: Piedzīvojumi
ru: Приключения

# genreFantasy
source: Fantasy
fr: Fantastique
lv: Fantāzija
ru: Фантастика

# genreFriendship
source: Friendship
fr: Amitié
lv: Draudzība
ru: Дружба

# genreFamily
source: Family
fr: Famille
lv: Ģimene
ru: Семья

# genreAnimals
source: Animals
fr: Animaux
lv: Dzīvnieki
ru: Животные

# genreMagic
source: Magic
fr: Magie
lv: Burvība
ru: Волшебство

# genreSpace
source: Space
fr: Espace
lv: Kosmoss
ru: Космос

# genreUnderwater
source: Underwater
fr: Sous-marin
lv: Zemūdens pasaule
ru: Подводный мир

# genreForest
source: Forest
fr: Forêt
lv: Mežs
ru: Лес

# genreFairyTale
source: Fairy Tale
fr: Conte de fées
lv: Pasaka
ru: Сказка

# genreSuperhero
source: Superhero
fr: Super-héros
lv: Supervaroņi
ru: Супергерои

# genreDinosaurs
source: Dinosaurs
fr: Dinosaures
lv: Dinozauri
ru: Динозавры

# genrePirates
source: Pirates
lv: Pirāti
ru: Пираты

# genrePrincess
source: Princess
fr: Princesse
lv: Princeses
ru: Принцессы

# genreDragons
source: Dragons
lv: Pūķi
ru: Драконы

# genreRobots
source: Robots
lv: Roboti
ru: Роботы

# genreMystery
source: Mystery
fr: Mystère
lv: Noslēpums
ru: Тайна

# genreFunny
source: Funny
fr: Drôle
lv: Smieklīgi
ru: Смешное

# genreEducational
source: Educational
fr: Éducatif
lv: Izglītojoši
ru: Обучающее

# genreBedtime
source: Bedtime Stories
fr: Contes du soir
lv: Gulētiešanas stāsti
ru: Сказки на ночь

# wizardNameTitle
source: What's your little one's name?
fr: Comment s'appelle votre petit?
lv: Kā sauc jūsu mazuli?
ru: Как зовут вашего малыша?

# wizardNameSubtitle
source: Choose a name and fun avatar
fr: Ce nom sera utilisé dans les histoires
lv: Šis vārds tiks izmantots stāstos
ru: Это имя будет использоваться в сказках

# wizardAgeTitle
source: How old is your little one?
fr: Quel âge a votre enfant?
lv: Cik gadu ir jūsu bērnam?
ru: Сколько лет вашему ребенку?

# wizardAgeSubtitle
source: This helps us choose the perfect vocabulary and themes
fr: Cela nous aidera à choisir des histoires appropriées
lv: Tas palīdzēs mums izvēlēties piemērotus stāstus
ru: Это поможет нам подобрать подходящие истории

# wizardGenderTitle
source: Tell us about your child
fr: Sélectionnez le genre de l'enfant
lv: Izvēlieties bērna dzimumu
ru: Выберите пол ребенка

# wizardGenderSubtitle
source: We'll use the right pronouns and perspective
fr: Cela aidera à créer des histoires plus personnalisées
lv: Tas palīdzēs radīt personalizētākus stāstus
ru: Это поможет создавать более персонализированные истории

# wizardAppearanceTitle
source: Help us personalize stories
fr: À quoi ressemble votre enfant?
lv: Kā izskatās jūsu bērns?
ru: Как выглядит ваш ребенок?

# wizardAppearanceSubtitle
source: Describe your child's appearance (optional)
fr: Décrivez son apparence ou téléchargez une photo
lv: Aprakstiet izskatu vai augšupielādējiet fotogrāfiju
ru: Опишите внешность или загрузите фото

# wizardGenresTitle
source: What does your child love?
fr: Quelles histoires votre enfant aime-t-il?
lv: Kādus stāstus mīl jūsu bērns?
ru: Какие истории любит ваш ребенок?

# wizardGenresSubtitle
source: Pick their favorite story types (optional)
fr: Choisissez les genres préférés
lv: Izvēlieties mīļākos žanrus
ru: Выберите любимые жанры

# wizardNotesTitle
source: Any special details?
fr: Notes spéciales
lv: Īpašās piezīmes
ru: Особые заметки

# wizardNotesSubtitle
source: Share interests, pets, or lessons to include (optional)
fr: Ajoutez du contexte: loisirs, intérêts, animaux domestiques
lv: Pievienojiet kontekstu: hobiji, intereses, mājdzīvnieki
ru: Добавьте контекст: увлечения, интересы, домашние животные

# wizardReviewTitle
source: Ready to create magic!
fr: Vérifiez les informations
lv: Pārbaudiet informāciju
ru: Проверьте информацию

# wizardReviewSubtitle
source: Review your child's profile
fr: Assurez-vous que tout est correct
lv: Pārliecinieties, ka viss ir pareizi
ru: Убедитесь, что все правильно

source: Enter name
fr: Entrez le nom
lv: Ievadiet vārdu
ru: Введите имя

source: Choose an avatar
fr: Choisissez un avatar
lv: Izvēlieties avatāru
ru: Выберите аватар

source: Boy
fr: Garçon
lv: Zēns
ru: Мальчик

source: Girl
fr: Fille
lv: Meitene
ru: Девочка

source: Prefer not to say
fr: Préfère ne pas spécifier
lv: Labāk nespecificēt
ru: Предпочитаю не указывать

source: Describe
fr: Décrire
lv: Aprakstīt
ru: Описать

source: Analyzing...
fr: Analyse en cours...
lv: Analizējam...
ru: Анализируем...

source: AI extracted appearance will appear here...
fr: L'IA extraira la description de l'apparence de la photo
lv: MI izvilks izskata aprakstu no foto
ru: ИИ извлечет описание внешности из фото

# appearanceDescriptionPlaceholder
source: e.g., Brown curly hair, green eyes, loves wearing dinosaur t-shirts...
fr: Par exemple: yeux bruns, cheveux foncés, taches de rousseur
lv: Piemēram: brūnas acis, tumši mati, vaiga plankumiņi
ru: Например: карие глаза, темные волосы, веснушки

source: Skip
fr: Ignorer
lv: Izlaist
ru: Пропустить

# continueButton
source: Continue
fr: Continuer
lv: Turpināt
ru: Продолжить

source: Back
fr: Retour
lv: Atpakaļ
ru: Назад

source: Step
fr: Étape
lv: Solis
ru: Шаг

# ofStep
source: of
fr: de
lv: no
ru: из

# notesPlaceholder
source: e.g., Has a pet dog named Max, loves space and rockets, learning about sharing...
fr: Par exemple: aime les dinosaures, a peur du noir, a un petit frère
lv: Piemēram: mīl dinozaurus, baidās no tumsas, ir jaunāks brālis
ru: Например: любит динозавров, боится темноты, есть младший брат

source: years old
fr: ans
lv: gadi
ru: лет

source: Special Notes
fr: Notes spéciales
lv: Īpašās piezīmes
ru: Особые заметки

# stepOfSteps
source: Step {currentStep} of {totalSteps}
fr: Étape {currentStep} de {totalSteps}
lv: Solis {currentStep} no {totalSteps}
ru: Шаг {currentStep} из {totalSteps}

# parentNotesHintText
source: e.g., Has a pet dog named Max, loves space and rockets, learning about sharing...
fr: ex.: A un chien nommé Max, aime l'espace et les fusées, apprend à partager...
lv: piemēram: Ir suns vārdā Makss, mīl kosmosu un raķetes, mācās dalīties...
ru: например: Есть собака по имени Макс, любит космос и ракеты, учится делиться...
