Repository: jberkovica/uol-fp
Catalog: app/lib/l10n/app_*.arb
Languages: fr, lv, ru

# appTitle
source: Mira Storyteller
fr: Mira Conteuse
lv: Mira Stāstniece
ru: Мира Сказочница

source: My tales
fr: Mes contes
lv: Mani stāsti
ru: Мои сказки

source: create
fr: créer
lv: izveidot
ru: создать

# favourites
source: Favorites
fr: Favoris
lv: Mīļākie
ru: Любимые

source: Latest
fr: Récents
lv: Jaunākie
ru: Последние

# kidStories
source: {kidName}'s stories
fr: Contes de {kidName}
lv: {kidName} stāsti
ru: Сказки {kidName}

source: No stories yet
fr: Pas encore de contes
lv: Pagaidām nav stāstu
ru: Пока нет сказок

source: Profile
fr: Profil
lv: Profils
ru: Профиль

source: Home
fr: Accueil
lv: Sākums
ru: Главная

source: Settings
fr: Paramètres
lv: Iestatījumi
ru: Настройки

source: Select Profile
fr: Sélectionner un Profil
lv: Izvēlieties profilu
ru: Выберите профиль

source: No profile selected
fr: Aucun profil sélectionné
lv: Nav izvēlēts profils
ru: Профиль не выбран

source: Magic is happening..
fr: La magie opère..
lv: Notiek brīnums..
ru: Происходит волшебство..

source: Upload your creation
fr: Téléchargez votre création
lv: Augšupielādējiet savu darbu
ru: Загрузите ваше творение

source: Drag & drop here
fr: Glissez-déposez ici
lv: Velciet un nometiet šeit
ru: Перетащите сюда

source: OR
fr: OU
lv: VAI
ru: ИЛИ

source: Browse file
fr: Parcourir
lv: Izvēlēties failu
ru: Выбрать файл

source: Generate story
fr: Générer un conte
lv: Izveidot stāstu
ru: Создать сказку

source: Sign In
fr: Se Connecter
lv: Ieiet
ru: Войти

source: Sign Up
fr: S'Inscrire
lv: Reģistrēties
ru: Регистрация

source: Email
fr: Adresse e-mail
lv: E-pasts
ru: Эл. почта

source: Password
fr: Mot de passe
lv: Parole
ru: Пароль

source: Confirm Password
fr: Confirmer le Mot de passe
lv: Apstipriniet paroli
ru: Подтвердите пароль

source: Forgot Password?
fr: Mot de passe oublié ?
lv: Aizmirsāt paroli?
ru: Забыли пароль?

# alreadyHaveAccount
source: Already have an account?
fr: Vous avez déjà un compte ?
lv: Jau ir konts?
ru: Уже есть аккаунт?

# dontHaveAccount
source: Don't have an account?
fr: Vous n'avez pas de compte ?
lv: Nav konta?
ru: Нет аккаунта?

source: Welcome back!
fr: Bon retour !
lv: Laipni lūdzam atpakaļ!
ru: С возвращением!

source: Create your account
fr: Créez votre compte
lv: Izveidojiet savu kontu
ru: Создайте ваш аккаунт

source: Parent Dashboard
fr: Panneau Parental
lv: Vecāku panelis
ru: Панель для родителей

source: Enter PIN
fr: Entrer le PIN
lv: Ievadiet PIN
ru: Введите PIN

# failedToLoadStories
source: Failed to load stories: {error}
fr: Échec du chargement des contes : {error}
lv: Neizdevās ielādēt stāstus: {error}
ru: Не удалось загрузить сказки: {error}

# audioRecordingComingSoon
source: Audio recording will be implemented soon!
fr: L'enregistrement audio sera bientôt disponible !
lv: Audio ierakstīšana drīz būs pieejama!
ru: Запись звука будет реализована в ближайшее время!

# textStoryComingSoon
source: Text story generation will be implemented soon!
fr: La génération de contes texte sera bientôt disponible !
lv: Teksta stāstu ģenerēšana drīz būs pieejama!
ru: Генерация текстовых историй будет реализована в ближайшее время!

# failedToPickImage
source: Failed to pick image: {error}
fr: Échec de la sélection d'image : {error}
lv: Neizdevās izvēlēties attēlu: {error}
ru: Не удалось выбрать изображение: {error}

# failedToGenerateStory
source: Failed to generate story: {error}
fr: Échec de la génération du conte : {error}
lv: Neizdevās izveidot stāstu: {error}
ru: Не удалось создать сказку: {error}

# pleaseEnterName
source: Please enter a name
fr: Veuillez entrer un nom
lv: Lūdzu, ievadiet vārdu
ru: Пожалуйста, введите имя

# failedToCreateProfile
source: Failed to create profile: {error}
fr: Échec de la création du profil : {error}
lv: Neizdevās izveidot profilu: {error}
ru: Не удалось создать профиль: {error}

source: Edit profile coming soon!
fr: Modifier le profil sera bientôt disponible !
lv: Profila rediģēšana drīz būs pieejama!
ru: Редактирование профиля скоро будет доступно!

source: Favorites coming soon!
fr: Les favoris seront bientôt disponibles !
lv: Izlase drīz būs pieejama!
ru: Избранное скоро будет доступно!

# failedToPlayAudio
source: Failed to play audio: {error}
fr: Échec de la lecture audio : {error}
lv: Neizdevās atskaņot audio: {error}
ru: Не удалось воспроизвести аудио: {error}

# incorrectPin
source: Incorrect PIN. Please try again.
fr: PIN incorrect. Veuillez réessayer.
lv: Nepareizs PIN. Lūdzu, mēģiniet vēlreiz.
ru: Неверный PIN. Попробуйте еще раз.

# accountCreatedSuccessfully
source: Account created successfully! Please check your email to verify your account.
fr: Compte créé avec succès ! Veuillez vérifier votre e-mail pour vérifier votre compte.
lv: Konts veiksmīgi izveidots! Pārbaudiet savu e-pastu, lai apstiprinātu kontu.
ru: Аккаунт успешно создан! Проверьте свою почту для подтверждения.

source: Apple sign in coming soon!
fr: La connexion avec Apple sera bientôt disponible !
lv: Pierakstīšanās ar Apple drīz būs pieejama!
ru: Вход через Apple скоро будет доступен!

source: Apple sign up coming soon!
fr: L'inscription avec Apple sera bientôt disponible !
lv: Reģistrācija ar Apple drīz būs pieejama!
ru: Регистрация через Apple скоро будет доступна!

# failedToLoadKids
source: Failed to load kids: {error}
fr: Échec du chargement des enfants : {error}
lv: Neizdevās ielādēt bērnus: {error}
ru: Не удалось загрузить детей: {error}

# addKidProfileFirst
source: Please add a kid profile first to create stories
fr: Veuillez d'abord ajouter un profil d'enfant pour créer des contes
lv: Vispirms pievienojiet bērna profilu, lai izveidotu stāstus
ru: Сначала добавьте профиль ребенка для создания сказок

# noKidsProfilesAvailable
source: No kids profiles available. Add a kid first!
fr: Aucun profil d'enfant disponible. Ajoutez d'abord un enfant !
lv: Nav bērnu profilu. Vispirms pievienojiet bērnu!
ru: Нет профилей детей. Сначала добавьте ребенка!

source: Change PIN coming soon!
fr: Changer le PIN sera bientôt disponible !
lv: PIN maiņa drīz būs pieejama!
ru: Изменение PIN скоро будет доступно!

source: Story settings coming soon!
fr: Les paramètres des contes seront bientôt disponibles !
lv: Stāstu iestatījumi drīz būs pieejami!
ru: Настройки сказок скоро будут доступны!

source: Export data coming soon!
fr: L'exportation des données sera bientôt disponible !
lv: Datu eksports drīz būs pieejams!
ru: Экспорт данных скоро будет доступен!

# deletingKidProfile
source: Deleting {kidName}'s profile...
fr: Suppression du profil de {kidName}...
lv: Dzēš {kidName} profilu...
ru: Удаление профиля {kidName}...

# kidProfileDeleted
source: {kidName}'s profile deleted successfully
fr: Profil de {kidName} supprimé avec succès
lv: {kidName} profils veiksmīgi dzēsts
ru: Профиль {kidName} успешно удален

# failedToDeleteProfile
source: Failed to delete profile: {error}
fr: Échec de la suppression du profil : {error}
lv: Neizdevās dzēst profilu: {error}
ru: Не удалось удалить профиль: {error}

# languageUpdatedTo
source: Language updated to {language}
fr: Langue mise à jour vers {language}
lv: Valoda mainīta uz {language}
ru: Язык изменен на {language}

source: Failed to update language
fr: Échec de la mise à jour de la langue
lv: Neizdevās mainīt valodu
ru: Не удалось изменить язык

# errorUpdatingLanguage
source: Error updating language: {error}
fr: Erreur lors de la mise à jour de la langue : {error}
lv: Kļūda mainot valodu: {error}
ru: Ошибка при изменении языка: {error}

source: upload
fr: télécharger
lv: augšupielādēt
ru: загрузить

source: dictate
fr: dicter
lv: diktēt
ru: диктовать

source: submit
fr: soumettre
lv: iesniegt
ru: отправить

source: Cancel
fr: Annuler
lv: Atcelt
ru: Отмена

source: Continue with Google
fr: Continuer avec Google
lv: Turpināt ar Google
ru: Продолжить с Google

source: Continue with Apple
fr: Continuer avec Apple
lv: Turpināt ar Apple
ru: Продолжить с Apple

source: Continue with Facebook
fr: Continuer avec Facebook
lv: Turpināt ar Facebook
ru: Продолжить с Facebook

source: Google sign in failed
fr: Échec de la connexion Google
lv: Google pierakstīšanās neizdevās
ru: Ошибка входа через Google

source: Apple sign in failed
fr: Échec de la connexion Apple
lv: Apple pierakstīšanās neizdevās
ru: Ошибка входа через Apple

source: Facebook sign in failed
fr: Échec de la connexion Facebook
lv: Facebook pierakstīšanās neizdevās
ru: Ошибка входа через Facebook

source: Create Account
fr: Créer un Compte
lv: Izveidot kontu
ru: Создать аккаунт

source: Edit Profile
fr: Modifier le Profil
lv: Rediģēt profilu
ru: Редактировать профиль

source: View Stories
fr: Voir les Contes
lv: Skatīt stāstus
ru: Посмотреть сказки

source: Delete Profile
fr: Supprimer le Profil
lv: Dzēst profilu
ru: Удалить профиль

source: Add Kid
fr: Ajouter un Enfant
lv: Pievienot bērnu
ru: Добавить ребенка

source: Decline
fr: Refuser
lv: Noraidīt
ru: Отклонить

source: Approve
fr: Approuver
lv: Apstiprināt
ru: Одобрить

source: Delete
fr: Supprimer
lv: Dzēst
ru: Удалить

source: Story preview
fr: Aperçu du conte
lv: Stāsta priekšskatījums
ru: Предпросмотр сказки

source: Exit Parent Mode
fr: Quitter le Mode Parent
lv: Iziet no vecāku režīma
ru: Выйти из родительского режима

source: Text Size
fr: Taille du Texte
lv: Teksta izmērs
ru: Размер текста

source: Background Music
fr: Musique de Fond
lv: Fona mūzika
ru: Фоновая музыка

source: Create Another Story
fr: Créer un Autre Conte
lv: Izveidot vēl vienu stāstu
ru: Создать еще одну сказку

source: Full Name (Optional)
fr: Nom Complet (Facultatif)
lv: Pilns vārds (neobligāti)
ru: Полное имя (необязательно)

# enterChildName
source: Enter child's name
fr: Entrez le nom de l'enfant
lv: Ievadiet bērna vārdu
ru: Введите имя ребенка

source: write your idea here...
fr: écrivez votre idée ici...
lv: rakstiet savu ideju šeit...
ru: напишите вашу идею здесь...

# enterFeedbackOrChanges
source: Enter any feedback or request changes...
fr: Entrez des commentaires ou demandez des modifications...
lv: Ievadiet atsauksmes vai pieprasiet izmaiņas...
ru: Введите отзыв или запросите изменения...

source: Transcribing audio...
fr: Transcription audio...
lv: Transkripcija notiek...
ru: Транскрипция аудио...

# changeNameAgeAvatar
source: Change name, age, or avatar
fr: Changer nom, âge ou avatar
lv: Mainīt vārdu, vecumu vai avatāru
ru: Изменить имя, возраст или аватар

source: Switch Profile
fr: Changer de Profil
lv: Mainīt profilu
ru: Сменить профиль

source: Change to different kid profile
fr: Changer vers un profil d'enfant différent
lv: Pārslēgties uz citu bērna profilu
ru: Переключиться на другой профиль ребенка

source: Favorite Stories
fr: Contes Favoris
lv: Mīļākie stāsti
ru: Любимые сказки

source: View your most loved tales
fr: Consultez vos contes les plus aimés
lv: Skatiet savus vismīļākos stāstus
ru: Посмотрите ваши самые любимые сказки

source: Language
fr: Langue
lv: Valoda
ru: Язык

source: Change PIN
fr: Changer le PIN
lv: Mainīt PIN
ru: Изменить PIN

# updateParentDashboardPin
source: Update your parent dashboard PIN
fr: Mettre à jour le PIN du panneau parental
lv: Atjaunināt vecāku paneļa PIN
ru: Обновить PIN родительской панели

source: Current PIN
fr: PIN Actuel
lv: Pašreizējais PIN
ru: Текущий PIN

source: New PIN
fr: Nouveau PIN
lv: Jaunais PIN
ru: Новый PIN

source: Confirm PIN
fr: Confirmer le PIN
lv: Apstiprināt PIN
ru: Подтвердить PIN

# enterCurrentPin
source: Enter your current PIN
fr: Entrez votre PIN actuel
lv: Ievadiet pašreizējo PIN
ru: Введите текущий PIN

# enterNewPin
source: Enter your new PIN
fr: Entrez votre nouveau PIN
lv: Ievadiet jauno PIN
ru: Введите новый PIN

# confirmNewPin
source: Confirm your new PIN
fr: Confirmez votre nouveau PIN
lv: Apstipriniet jauno PIN
ru: Подтвердите новый PIN

source: PINs do not match
fr: Les PINs ne correspondent pas
lv: PIN kodi nesakrīt
ru: PIN-коды не совпадают

source: PIN changed successfully
fr: PIN changé avec succès
lv: PIN veiksmīgi nomainīts
ru: PIN успешно изменен

source: Incorrect current PIN
fr: PIN actuel incorrect
lv: Nepareizs pašreizējais PIN
ru: Неверный текущий PIN

source: Story Settings
fr: Paramètres des Contes
lv: Stāstu iestatījumi
ru: Настройки сказок

source: Configure story generation preferences
fr: Configurer les préférences de génération de contes
lv: Konfigurēt stāstu ģenerēšanas preferences
ru: Настроить параметры генерации сказок

source: Export Data
fr: Exporter les Données
lv: Eksportēt datus
ru: Экспорт данных

source: Download all stories and data
fr: Télécharger tous les contes et données
lv: Lejupielādēt visus stāstus un datus
ru: Скачать все сказки и данные

source: No story data available
fr: Aucune donnée de conte disponible
lv: Stāsta dati nav pieejami
ru: Данные сказки недоступны

# currentFontSize
source: Current: {size}pt
fr: Actuel : {size}pt
lv: Pašreizējais: {size}pt
ru: Текущий: {size}pt

source: Enabled
fr: Activé
lv: Ieslēgts
ru: Включено

source: Disabled
fr: Désactivé
lv: Izslēgts
ru: Выключено

source: Kids Profiles
fr: Profils d'Enfants
lv: Bērnu profili
ru: Профили детей

source: Total Stories
fr: Total des Contes
lv: Kopā stāstu
ru: Всего сказок

source: No Kids Profiles Yet
fr: Pas Encore de Profils d'Enfants
lv: Pagaidām nav bērnu profilu
ru: Пока нет профилей детей

# addFirstKidProfile
source: Add your first kid profile to get started with personalized stories!
fr: Ajoutez votre premier profil d'enfant pour commencer avec des contes personnalisés !
lv: Pievienojiet pirmo bērna profilu personalizētiem stāstiem!
ru: Добавьте первый профиль ребенка для персонализированных сказок!

source: Parent Controls
fr: Contrôles Parentaux
lv: Vecāku kontrole
ru: Родительский контроль

source: Select Language
fr: Sélectionner la Langue
lv: Izvēlieties valodu
ru: Выберите язык

source: New Story
fr: Nouveau Conte
lv: Jauns stāsts
ru: Новая сказка

# stories
source: {count} {count, plural, =0{stories} =1{story} other{stories}}
fr: {count} {count, plural, =0{contes} =1{conte} other{contes}}
lv: {count} {count, plural, =0{stāstu} =1{stāsts} other{stāsti}}
ru: {count} {count, plural, =0{сказок} =1{сказка} few{сказки} other{сказок}}

source: Created {date}
fr: Créé le {date}
lv: Izveidots {date}
ru: Создано {date}

# deleteProfileConfirm
source: Are you sure you want to delete {kidName}'s profile? This will also delete all their {storyCount} stories.
fr: Êtes-vous sûr de vouloir supprimer le profil de {kidName} ? Cela supprimera aussi tous ses {storyCount} contes.
lv: Vai tiešām vēlaties dzēst {kidName} profilu? Tas arī dzēsīs visus {storyCount} stāstus.
ru: Вы уверены, что хотите удалить профиль {kidName}? Это также удалит все {storyCount} сказок.

# profileDetails
source: Profile: {avatarType}
fr: Profil : {avatarType}
lv: Profils: {avatarType}
ru: Профиль: {avatarType}

# creatingStoriesSince
source: Creating stories since {date}
fr: Crée des contes depuis {date}
lv: Rada stāstus kopš {date}
ru: Создает сказки с {date}

source: Stories Created
fr: Contes Créés
lv: Stāsti izveidoti
ru: Создано сказок

source: Words Written
fr: Mots Écrits
lv: Vārdi uzrakstīti
ru: Слов написано

source: Profile Options
fr: Options de Profil
lv: Profila opcijas
ru: Настройки профиля

# changeToDifferentProfile
source: Change to different kid profile
fr: Changer vers un profil d'enfant différent
lv: Pārslēgties uz citu bērna profilu
ru: Переключиться на другой профиль ребенка

# pleaseEnterEmail
source: Please enter your email
fr: Veuillez entrer votre adresse e-mail
lv: Lūdzu, ievadiet savu e-pastu
ru: Пожалуйста, введите ваш email

# pleaseEnterValidEmail
source: Please enter a valid email
fr: Veuillez entrer une adresse e-mail valide
lv: Lūdzu, ievadiet derīgu e-pastu
ru: Пожалуйста, введите корректный email

# passwordMinLength
source: Password must be at least 6 characters
fr: Le mot de passe doit comporter au moins 6 caractères
lv: Parolei jābūt vismaz 6 simbolu garai
ru: Пароль должен содержать минимум 6 символов

source: Passwords do not match
fr: Les mots de passe ne correspondent pas
lv: Paroles nesakrīt
ru: Пароли не совпадают

# pleaseEnterPassword
source: Please enter a password
fr: Veuillez entrer un mot de passe
lv: Lūdzu, ievadiet paroli
ru: Пожалуйста, введите пароль

# pleaseConfirmPassword
source: Please confirm your password
fr: Veuillez confirmer votre mot de passe
lv: Lūdzu, apstipriniet paroli
ru: Пожалуйста, подтвердите пароль

source: Story approved successfully!
fr: Conte approuvé avec succès !
lv: Stāsts veiksmīgi apstiprināts!
ru: Сказка одобрена успешно!

source: Story declined
fr: Conte refusé
lv: Stāsts noraidīts
ru: Сказка отклонена

source: Decline Story
fr: Refuser le Conte
lv: Noraidīt stāstu
ru: Отклонить сказку

# pleaseProvideReason
source: Please provide a reason for declining:
fr: Veuillez fournir une raison pour le refus :
lv: Lūdzu, norādiet noraidīšanas iemeslu:
ru: Пожалуйста, укажите причину отклонения:

# declineReasonHint
source: E.g., too scary, inappropriate content, etc.
fr: Ex., trop effrayant, contenu inapproprié, etc.
lv: Piemēram, pārāk baidoši, nepiedienīgs saturs utt.
ru: Например, слишком страшно, неподходящий контент и т.д.

source: Suggest Edits
fr: Suggérer des Modifications
lv: Ieteikt izmaiņas
ru: Предложить правки

# provideSuggestions
source: Provide suggestions to improve the story:
fr: Fournissez des suggestions pour améliorer le conte :
lv: Sniedziet ieteikumus stāsta uzlabošanai:
ru: Предложите улучшения для сказки:

# suggestionsHint
source: E.g., make it less scary, add more about friendship, etc.
fr: Ex., le rendre moins effrayant, ajouter plus sur l'amitié, etc.
lv: Piemēram, padarīt mazāk baidošu, pievienot vairāk par draudzību utt.
ru: Например, сделать менее страшно, добавить больше о дружбе и т.д.

# regeneratingStory
source: Regenerating story with your suggestions...
fr: Régénération du conte avec vos suggestions...
lv: Izveidojam jaunu stāsta versiju ar jūsu ieteikumiem...
ru: Создаем новую версию сказки с вашими предложениями...

source: Regenerate Story
fr: Régénérer le Conte
lv: Izveidot jaunu versiju
ru: Создать новую версию

source: Image not available
fr: Image non disponible
lv: Attēls nav pieejams
ru: Изображение недоступно

source: Pending Stories
fr: Contes en Attente
lv: Gaida apstiprinājumu
ru: Ожидают одобрения

# noPendingStories
source: No pending stories for review
fr: Aucun conte en attente de révision
lv: Nav stāstu, kas gaida apstiprinājumu
ru: Нет историй ожидающих одобрения

# allStoriesReviewed
source: All stories have been reviewed
fr: Tous les contes ont été révisés
lv: Visi stāsti ir pārskatīti
ru: Все истории проверены

# forChild
source: For {childName}
fr: Pour {childName}
lv: Priekš {childName}
ru: Для {childName}

source: Review
fr: Réviser
lv: Pārskatīt
ru: Проверить

source: Approval Method
fr: Méthode d'Approbation
lv: Apstiprinājuma veids
ru: Способ одобрения

source: Select Approval Method
fr: Sélectionner la Méthode d'Approbation
lv: Izvēlieties apstiprinājuma veidu
ru: Выберите способ одобрения

source: Auto Approve
fr: Approuver Automatiquement
lv: Automātiski apstiprināt
ru: Автоматическое одобрение

source: Review in App
fr: Réviser dans l'App
lv: Pārskatīt lietotnē
ru: Проверка в приложении

source: Review by Email
fr: Réviser par E-mail
lv: Pārskatīt pa e-pastu
ru: Проверка по email

# autoApproveDescription
source: Stories are automatically approved and available immediately
fr: Les contes sont automatiquement approuvés et disponibles immédiatement
lv: Stāsti tiek automātiski apstiprināti un uzreiz pieejami
ru: Истории автоматически одобряются и сразу становятся доступными

# reviewInAppDescription
source: Review stories in the parent dashboard before they're shown to children
fr: Révisez les contes dans le panneau parental avant de les montrer aux enfants
lv: Pārskatiet stāstus vecāku panelī, pirms tie tiek rādīti bērniem
ru: Проверяйте истории в родительской панели перед показом детям

# reviewByEmailDescription
source: Receive email notifications to review stories before approval
fr: Recevez des notifications par e-mail pour réviser les contes avant approbation
lv: Saņemiet e-pasta paziņojumus, lai pārskatītu stāstus pirms apstiprināšanas
ru: Получайте уведомления по email для проверки историй перед одобрением

# approvalMethodUpdated
source: Approval method updated to {method}
fr: Méthode d'approbation mise à jour vers {method}
lv: Apstiprinājuma veids nomainīts uz {method}
ru: Способ одобрения изменен на {method}

source: Failed to update approval method
fr: Échec de la mise à jour de la méthode d'approbation
lv: Neizdevās nomainīt apstiprinājuma veidu
ru: Не удалось изменить способ одобрения

# errorUpdatingApprovalMethod
source: Error updating approval method: {error}
fr: Erreur lors de la mise à jour de la méthode d'approbation : {error}
lv: Kļūda mainot apstiprinājuma veidu: {error}
ru: Ошибка при изменении способа одобрения: {error}

source: Your story is ready!
fr: Votre conte est prêt !
lv: Tavs stāsts ir gatavs!
ru: Ваша история готова!

source: Parent review pending
fr: Révision parentale en attente
lv: Gaida vecāku apstiprinājumu
ru: Ожидает одобрения родителей

# tapReviewToApprove
source: Tap Review to ask parent for approval
fr: Appuyez sur Réviser pour demander l'approbation parentale
lv: Nospied Pārskatīt, lai lūgtu vecāku apstiprinājumu
ru: Нажмите Проверить, чтобы попросить родителей одобрить

# weWillNotifyWhenReady
source: We'll let you know when your story is ready!
fr: Nous vous préviendrons quand votre conte sera prêt !
lv: Mēs paziņosim, kad tavs stāsts būs gatavs!
ru: Мы сообщим, когда ваша история будет готова!

# openStory
source: open
fr: ouvrir
lv: atvērt
ru: открыть

# pleaseEnterText
source: Please enter some text to create your story
fr: Veuillez entrer du texte pour créer votre conte
lv: Lūdzu, ievadiet tekstu, lai izveidotu stāstu
ru: Пожалуйста, введите текст для создания истории

# textTooShort
source: Please write at least 10 characters for your story idea
fr: Veuillez écrire au moins 10 caractères pour votre idée de conte
lv: Lūdzu, uzrakstiet vismaz 10 simbolus savas stāsta idejas aprakstam
ru: Пожалуйста, напишите хотя бы 10 символов для вашей идеи истории

# textTooLong
source: Text is too long. Please keep it under 500 characters
fr: Le texte est trop long. Veuillez le garder sous 500 caractères
lv: Teksts ir pārāk garš. Lūdzu, ierobežojiet to līdz 500 simboliem
ru: Текст слишком длинный. Пожалуйста, сократите до 500 символов

# pleaseSelectChild
source: Please select a child first
fr: Veuillez d'abord sélectionner un enfant
lv: Lūdzu, vispirms izvēlieties bērnu
ru: Пожалуйста, сначала выберите ребенка

source: Recording
fr: Enregistrement
lv: Ierakstīšana
ru: Запись

source: Stop Recording
fr: Arrêter l'Enregistrement
lv: Beigt ierakstīšanu
ru: Остановить запись

# microphonePermissionRequired
source: Microphone permission is required to record audio
fr: Permission du microphone requise pour enregistrer l'audio
lv: Mikrofonam ir nepieciešama atļauja audio ierakstīšanai
ru: Для записи аудио требуется разрешение на использование микрофона

source: Failed to start recording
fr: Échec du démarrage de l'enregistrement
lv: Neizdevās sākt ierakstīšanu
ru: Не удалось начать запись

source: Failed to stop recording
fr: Échec de l'arrêt de l'enregistrement
lv: Neizdevās beigt ierakstīšanu
ru: Не удалось остановить запись

source: No recording available
fr: Aucun enregistrement disponible
lv: Ieraksts nav pieejams
ru: Запись недоступна

source: Logout
fr: Se Déconnecter
lv: Iziet no konta
ru: Выйти из аккаунта

source: Add New Profile
fr: Ajouter un Nouveau Profil
lv: Pievienot jaunu profilu
ru: Добавить новый профиль

source: Create Profile
fr: Créer un Profil
lv: Izveidot profilu
ru: Создать профиль

source: Create New Profile
fr: Créer un Nouveau Profil
lv: Izveidot jaunu profilu
ru: Создать новый профиль
